import os




def menu():
    os.system('cls||clear')
    print("--------------------Меню-----------------------")
    print("|1. Отримання імен таблиць БД                 |")
    print("|2. Отримання імен та типів стовпчиків таблиці|")
    print("|3. Отримання імен стовпчиків таблиці         |") 
    print("|4. Отримання зовнішніх ключів таблиці        |")
    print("|5. Генерування даних в таблиці               |")
    print("|6. Вставка даних в таблицю                   |")
    print("|7. Оновлення даних в таблиці                 |")
    print("|8. Видалення даних в таблиці                 |")
    print("|9. Отримання даних таблиці БД                |")
    print("|10. Видалення всіх даних таблиці БД          |")
    print("|11. Припинити програму                       |")
    print("|_____________________________________________|")


def show(mas):
    for element in mas:
        print(element)
    

